---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.DuctSettings
source: html/4ed986b9-6acf-fd83-80a7-97413ee8fd0b.htm
---
# DuctSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.